ЛИС2/src/Documents/лис_АктОтбораПроб/лис_АктОтбораПроб.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>лис_АктОтбораПроб</name>
  <registerRecords>AccumulationRegister.лис_ОтобранныеПробы</registerRecords>
  <registerRecords>InformationRegister.лис_ОтборПроб</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.лис_Лаборатории</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПлана</name>
    <type>
      <types>DocumentRef.лис_ПланОтбораПроб</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтбора</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПроб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектКонтроля</name>
    <type>
      <types>CatalogRef.ВодныеОбъекты</types>
      <types>CatalogRef.ПроизводственныеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектОтбораПроб</name>
    <type>
      <types>CatalogRef.ВодныеОбъекты</types>
      <types>CatalogRef.ИсточникиЗагрязнения</types>
      <types>CatalogRef.Водозаборы</types>
      <types>CatalogRef.СелитебныеЗоны</types>
      <types>CatalogRef.Скважины</types>
      <types>CatalogRef.СанитарноЗащитныеЗоны</types>
      <types>CatalogRef.ВыпускиВВоду</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦельОтбораПроб</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОборудованиеДляОтбораПроб</name>
    <type>
      <types>CatalogRef.лис_ЛабораторноеОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>КонсервацияУсловияПроведенияАнализа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияТранспортировкиИХраненияПроб</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураВодыПриОтборе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураВоздухаВМестеОтбора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормативныеДокументы</name>
    <type>
      <types>CatalogRef.ЗаконодательныеИНормативныеТребования</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеНД</name>
    <type>
      <types>CatalogRef.ЗаконодательныеИНормативныеТребования1</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеВыдал</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеПолучил</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтобралПробу</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрисутствовалПриОтбореПроб</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПробуПринял</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатНаружнегоОсмотраПроб</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяИДатаДоставкиВЛабораторию</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомерПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделУчета</name>
    <type>
      <types>EnumRef.РазделыУчетаЭкоаналитическогоКонтроля</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Пробы</name>
    <attributes>
      <name>ТочкаОтбораПробы</name>
      <type>
        <types>CatalogRef.ТочкиКонтроля</types>
      </type>
    </attributes>
    <attributes>
      <name>ОпределяемыйПоказатель</name>
      <type>
        <types>CatalogRef.ВеществаИПараметрыВАтмосферныхОсадках</types>
        <types>CatalogRef.КонтролируемыеПараметрыВПочвеДонныхОтложениях</types>
        <types>CatalogRef.ЗВВода</types>
        <types>CatalogRef.КонтролируемыеПоказателиВВоде</types>
        <types>CatalogRef.ФакторыФизическогоВоздействия</types>
        <types>CatalogRef.ЗВАтмосфера</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕмкостиДляОтбораПроб</name>
      <type>
        <types>CatalogRef.лис_ЛабораторныеПринадлежности</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемПробы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>КонсервантыДляАнализа</name>
      <type>
        <types>CatalogRef.лис_ЛабораторныеРеактивы</types>
      </type>
    </attributes>
    <attributes>
      <name>ШифрПробы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЛИС2/src/Enums/ПериодыПроверкиЭкоаналитическогоКонтроля/ПериодыПроверкиЭкоаналитическогоКонтроля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПериодыПроверкиЭкоаналитическогоКонтроля</name>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Декада</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Квартал</name>
  </enumValues>
  <enumValues>
    <name>Полгода</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
</mdclass:Enum>

ЛИС2/src/Documents/лис_ПланОтбораПроб/лис_ПланОтбораПроб.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>лис_ПланОтбораПроб</name>
  <attributes>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.лис_Лаборатории</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеЛаборатории</name>
    <type>
      <types>CatalogRef.лис_ПодразделенияЛабораторий</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидГрафика</name>
    <type>
      <types>EnumRef.РазделыУчетаЭкоаналитическогоКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйСотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Основное</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектЗагрязнения</name>
      <type>
        <types>CatalogRef.ВодныеОбъекты</types>
        <types>CatalogRef.ИсточникиЗагрязнения</types>
        <types>CatalogRef.ПроизводственныеПлощадки</types>
        <types>CatalogRef.Водозаборы</types>
        <types>CatalogRef.СелитебныеЗоны</types>
        <types>CatalogRef.Скважины</types>
        <types>CatalogRef.СанитарноЗащитныеЗоны</types>
        <types>CatalogRef.ВыпускиВВоду</types>
      </type>
    </attributes>
    <attributes>
      <name>ТочкаКонтроля</name>
      <type>
        <types>CatalogRef.ТочкиКонтроля</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗамеров</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодичностьЗамеров</name>
      <type>
        <types>EnumRef.ПериодыПроверкиЭкоаналитическогоКонтроля</types>
      </type>
    </attributes>
    <attributes>
      <name>КемОсуществляетсяКонтроль</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановаяДатаОт</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПлановаяДатаДо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СотрудникПроводящийЗамер</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗагрязняющиеВещества</name>
    <attributes>
      <name>ЗагрязняющееВещество</name>
      <type>
        <types>CatalogRef.ВеществаИПараметрыВАтмосферныхОсадках</types>
        <types>CatalogRef.КонтролируемыеПараметрыВПочвеДонныхОтложениях</types>
        <types>CatalogRef.ЗВВода</types>
        <types>CatalogRef.КонтролируемыеПоказателиВВоде</types>
        <types>CatalogRef.ФакторыФизическогоВоздействия</types>
        <types>CatalogRef.ЗВАтмосфера</types>
      </type>
    </attributes>
    <attributes>
      <name>МетодикаАнализа</name>
      <type>
        <types>CatalogRef.МетодикиОпределенияИзмеренияАнализа</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЛИС2/src/Documents/лис_АктОтбораПроб/Forms/ФормаПодбораНаДату/Module.bsl
&НаКлиенте
Процедура ПланОтбораПриИзменении(Элемент)
	
	Элементы.Сформировать.Доступность = Ложь;
	Элементы.КоличествоАктов.Видимость = Ложь;
	КоличествоАктов = 0;
	Отборы.Параметры.УстановитьЗначениеПараметра("ПланОтбораПроб", ПланОтбора);	
		
КонецПроцедуры

&НаКлиенте
Процедура ДатаОтбораПриИзменении(Элемент)
	
	Элементы.Сформировать.Доступность = Ложь;
	Элементы.КоличествоАктов.Видимость = Ложь;
	КоличествоАктов = 0;
	Отборы.Параметры.УстановитьЗначениеПараметра("ДатаОтбора", ДатаОтбора);	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаОтбора = ТекущаяДата();
	Отборы.Параметры.УстановитьЗначениеПараметра("ДатаОтбора", ДатаОтбора);
	Отборы.Параметры.УстановитьЗначениеПараметра("ПланОтбораПроб", Документы.лис_ПланОтбораПроб.ПустаяСсылка());
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборыПриАктивизацииСтроки(Элемент)
	
	Если ЗначениеЗаполнено(Элементы.Отборы.ТекущаяСтрока) Тогда
		Элементы.Сформировать.Доступность = Истина;
		Элементы.КоличествоАктов.Видимость = Истина;
		ВыделенныеСтроки = Элементы.Отборы.ВыделенныеСтроки;
		КоличествоАктов = 0;
		Для каждого НомерСтроки Из ВыделенныеСтроки Цикл
			ТекущаяСтрока = Элементы.Отборы.ДанныеСтроки(НомерСтроки);
			КоличествоАктов = КоличествоАктов + ОпределитьКоличествоАктов(ТекущаяСтрока);
		КонецЦикла;		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ОпределитьКоличествоАктов(ТекущаяСтрока)
	
	Если ТекущаяСтрока.ПериодичностьЗамеров = Перечисления.ПериодыПроверкиЭкоаналитическогоКонтроля.День Тогда
		Возврат ТекущаяСтрока.КоличествоЗамеров;
	Иначе
		Возврат 1;
	КонецЕсли;	
		
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
	
	ВыделенныеСтроки = Элементы.Отборы.ВыделенныеСтроки;
	Для каждого НомерСтроки Из ВыделенныеСтроки Цикл
		ТекущаяСтрока = Элементы.Отборы.ДанныеСтроки(НомерСтроки);
		СформироватьАктыОтбора(ТекущаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьАктыОтбора(ТекущаяСтрока)

	Если ТекущаяСтрока.ПериодичностьЗамеров = Перечисления.ПериодыПроверкиЭкоаналитическогоКонтроля.День Тогда
		НеобходимоАктов = ТекущаяСтрока.КоличествоЗамеров;
	Иначе
		НеобходимоАктов = 1;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	лис_ПланОтбораПробЗагрязняющиеВещества.ЗагрязняющееВещество,
	|	лис_ПланОтбораПробЗагрязняющиеВещества.МетодикаАнализа
	|ИЗ
	|	Документ.лис_ПланОтбораПроб.ЗагрязняющиеВещества КАК лис_ПланОтбораПробЗагрязняющиеВещества
	|ГДЕ
	|	лис_ПланОтбораПробЗагрязняющиеВещества.Ссылка = &Ссылка
	|	И лис_ПланОтбораПробЗагрязняющиеВещества.КлючСтроки = &КлючСтроки";
	Запрос.УстановитьПараметр("Ссылка", ПланОтбора);
	Запрос.УстановитьПараметр("КлючСтроки", ТекущаяСтрока.КлючСтроки);
	
	Вещества = Запрос.Выполнить().Выгрузить();
	
	СозданоАктов = 0;
	Пока СозданоАктов < НеобходимоАктов Цикл
		
		НовыйДокумент = Документы.лис_АктОтбораПроб.СоздатьДокумент();
		НовыйДокумент.Дата = ДатаОтбора;
		НовыйДокумент.ДатаОтбора = ДатаОтбора;
		НовыйДокумент.Организация = ТекущаяСтрока.Организация;
		НовыйДокумент.Лаборатория = ПланОтбора.Лаборатория;
		
		
		Для каждого Строка Из Вещества Цикл
			СтрокаПробы = НовыйДокумент.Пробы.Добавить();
			СтрокаПробы.ОпределяемыйПоказатель = Строка.ЗагрязняющееВещество;
			//СтрокаПробы.ТочкаОтбораПробы = ТекущаяСтрока.
		КонецЦикла;		
		
		НовыйДокумент.КоличествоПроб = НовыйДокумент.Пробы.Количество();
		НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
		
		СозданоАктов = СозданоАктов + 1;
	КонецЦикла; 
		
КонецПроцедуры
